Revit 2025 API
ParameterTypeId.OmniclassDescription Property
 "OmniClass Title"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static ForgeTypeId OmniclassDescription { get; }
Public Shared ReadOnly Property OmniclassDescription As ForgeTypeId
	Get
public:
static property ForgeTypeId^ OmniclassDescription {
	ForgeTypeId^ get ();
}
static member OmniclassDescription : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace